
# 01：专用发票:
# 增值税专用发票：10位，第1～4位代表各省；第5～6位代表制版年度；第7位代表印制批次；第8位代表发票种类，普通发票用“6”表示；第9位代表几联版，二联版用“2”表示，五联版用“5”表示；第10位代表金额版本号，“0”表示电脑版。
# 二手车专用发票：12位，第1位为0；第2-5位代表省、自治区、直辖市和计划单列市；第6-7位代表年度；第8-10位代表批次；第11-12位为17
# 机动车销售发票：12位，发票代码前五位为 税务机关代码 11100  第八位数字为2
# 04：普票发票:12位，第1位为0;第2-5位代表省、自治区、直辖市和计划单列市;第6-7位代表年度;第8-10位代表批次;第11-12位代表票种和联次，其中04代表二联增值税普通发票、05代表五联增值税普通发票。
# 10：电子发票:12位，
# 电子普通发票：第1位为0；第2-5位代表省、自治区、直辖市和计划单列市；第6-7位代表年度；第8-10位代表批次；第11-12位代表票种(11代表增值税电子普通发票)。
# 电子通行费：第1位为0；第2-5位代表省、自治区、直辖市和计划单列市；第6-7位代表年度；第8-10位代表批次；第11-12位为12；
# 11：卷式发票:12位，第1位为0；第2-5位代表省、自治区、直辖市和计划单列市；第6-7位代表年度,第8-10位代表批次；第11-12位代表票种和规格；其中06代表57mm×177.8mm增值税普通发票(卷票)；07代表76mm×177.8mm增值税普通发票(卷票).
def piaozhong(invoicecode):
    if len(invoicecode) == 12:
        if invoicecode[:1] == '0':
            if invoicecode[-2:] == '04':#增值税普通2联发票
                return({'code':'04','name':'增值税普通2联发票'})
            elif invoicecode[-2:] == '05':#增值税普通5联发票
                return({'code':'04','name':'增值税普通5联发票'})
            elif invoicecode[-2:] == '06':#增值税卷式57mm窄票
                return({'code':'04','name':'增值税卷式57mm窄票'})
            elif invoicecode[-2:] == '07':#增值税卷式76mm宽票
                return({'code':'04','name':'增值税卷式76mm宽票'})
            elif invoicecode[-2:] == '11':#增值税电子普通发票
                return({'code':'10','name':'增值税电子普通发票'})
            elif invoicecode[-2:] == '12':#增值税电子通行费发票
                return({'code':'10','name':'增值税电子通行费发票'})
            elif invoicecode[-2:] == '17':#增值税二手车交易发票
                return({'code':'01','name':'增值税二手车交易发票'})
        else:
            return({'code':'01','name':'机动车统一销售发票'})#机动车统一销售发票
    elif len(invoicecode) == 10:
        return({'code':'01','name':'增值税专用发票'})#增值税专用发票
    else:
        return({'code':'99','name':'无法查验票种'})#无法查验票种
if __name__ == '__main__':
    a=piaozhong('037001700111')
    print(a['name'])
    a=piaozhong('3100113140')
    print(a['name'])
    a=piaozhong('143001619928')
    print(a['name'])
    a=piaozhong('04001700107')
    print(a['name'])
    a=piaozhong('051001700112')
    print(a['name'])
    a=piaozhong('014001800117')
    print(a['name'])
    a=piaozhong('013001700112')
    print(a['name'])
    a=piaozhong('062001700107')
    print(a['name'])
    

